//package com.javarush.test.level26.lesson02.task01;
//
//import java.util.Arrays;
//import java.util.Comparator;
//
///* Почитать в инете про медиану выборки
//Реализовать логику метода sort, который должен сортировать данные в массиве по удаленности от его медианы
//Вернуть отсортированный массив от минимального расстояния до максимального
//Если удаленность одинаковая у нескольких чисел, то выводить их в порядке возрастания
//*/
//public class Solution {
//    public static Integer[] sort(Integer[] array) {
//        //implement logic here
//        Arrays.sort(array);
//        final double med;
//        if (array.length % 2 == 0) {
//            med = (array[array.length/2 - 1] + array[array.length/2]) / 2.0;
//        } else{
//            med = array[array.length/2];
//        }
//        Comparator<Integer> median = new Comparator<Integer>() {
//            @Override
//            public int compare(Integer o1, Integer o2) {
//                double value = Math.abs(o1-med) - Math.abs(o2-med);
//                if (value == 0)
//                    value = o1 - o2;
//                return (int)value;
//            }
//        };
//        Arrays.sort(array, median);
//        for (int a : array) {
//            System.out.print(a + " ");
//        }
//        return array;
//    }
//}
